<html>
<head>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body leftmargin="5" marginwidth="5" topmargin="5" marginheight="5">

<table border="0" width="100%" class="bordure" cellspacing="0" cellpadding="1">
<tr><td>
<table border="0" width="100%" class="textSubTitleCenter" cellspacing="0" cellpadding="0">
<tr><td class="textTitle">JvRoad</td>
<td class="textSubTitleRight">Manuel de r&eacute;f&eacute;rence</tr>
<tr><td colspan="2"><br>Les boutons concernant l'impression</td></tr>
</table>
</td></tr></table>
<br>
<div class="textJustify">
<img src="images/print.gif" border="0">&nbsp;&nbsp;
<b>Imprimer</b>
&nbsp;&nbsp;(Alt+LI ou Ctrl+P)<br>
Pour imprimer le road book en cours d'&eacute;dition.
<br><br>

<img src="images/preview.gif" border="0">&nbsp;&nbsp;
<b>Aper&ccedil;u impression</b>
&nbsp;&nbsp;(Alt+LA)<br>
Pour afficher la <a href="dlgpreview.html">fen&ecirc;tre d'aper&ccedil;u avant impression</a>. Cette fen&ecirc;tre permet de modifier la pr&eacute;sentation des pages et d'en visualiser le r&eacute;sultat sans qu'il soit n&eacute;cessaire de les imprimer.
<br><br>

<img src="images/disptwoc.gif" border="0">&nbsp;&nbsp;
<b>Deux colonnes par page</b>
&nbsp;&nbsp;(Alt+SPD)<br>
Pour indiquer que les cases sont dessin&eacute;s sur deux colonnes &agrave; raison d'une page par feuille de papier.
<br><br>

<img src="images/dispmono.gif" border="0">&nbsp;&nbsp;
<b>Une colonne par page</b>
&nbsp;&nbsp;(Alt+SPU)<br>
Pour indiquer que les cases sont dessin&eacute;s sur une seule colonne &agrave; raison d'une page par feuille de papier.
<br><br>

<img src="images/disptwop.gif" border="0">&nbsp;&nbsp;
<b>Deux pages avec une colonne</b>
&nbsp;&nbsp;(Alt+SPP)<br>
Pour indiquer que les cases sont dessin&eacute;s sur une seule colonne &agrave; raison de deux pages par feuille de papier.
<br><br>

<img src="images/disprwoc.gif" border="0">&nbsp;&nbsp;
<b>Deux colonnes par page avec ent&ecirc;te simplifi&eacute;e</b>
&nbsp;&nbsp;(Alt+SPR)<br>
Pour indiquer que les cases sont dessin&eacute;s sur deux colonnes avec une ent&ecirc;te simplifi&eacute;e &agrave; raison d'une page par feuille de papier.
<br><br>

<img src="images/disprono.gif" border="0">&nbsp;&nbsp;
<b>Une colonne par page avec ent&ecirc;te simplifi&eacute;e</b>
&nbsp;&nbsp;(Alt+SPA)<br>
Pour indiquer que les cases sont dessin&eacute;s sur une seule colonne avec une ent&ecirc;te simplifi&eacute;e &agrave; raison d'une page par feuille de papier.
<br><br>

<img src="images/disprwop.gif" border="0">&nbsp;&nbsp;
<b>Deux pages avec une colonne avec ent&ecirc;te simplifi&eacute;e</b>
&nbsp;&nbsp;(Alt+SPI)<br>
Pour indiquer que les cases sont dessin&eacute;s sur une seule colonne avec une ent&ecirc;te simplifi&eacute;e &agrave; raison de deux pages par feuille de papier.
<br><br>
</div>
</body>
</html>