<html>
<head>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body leftmargin="5" marginwidth="5" topmargin="5" marginheight="5">

<table border="0" width="100%" class="bordure" cellspacing="0" cellpadding="1">
<tr><td>
<table border="0" width="100%" class="textSubTitleCenter" cellspacing="0" cellpadding="0">
<tr><td class="textTitle">JvRoad</td>
<td class="textSubTitleRight">Manuel de r&eacute;f&eacute;rence</tr>
<tr><td colspan="2"><br>Les boutons concernant les ponts</td></tr>
</table>
</td></tr></table>
<br>
<div class="textJustify">
<img src="images/efface.gif" border="0">&nbsp;&nbsp;
<b>Effacer</b><br>
Pour s&eacute;lectionner l'effaceur de ponts.<br><br>

<img src="images/pontsenv.gif" border="0">&nbsp;&nbsp;
<b>Pont vertical avec un sentier ou hors piste</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont vertical avec un sentier ou hors piste.<br><br>

<img src="images/pontsenh.gif" border="0">&nbsp;&nbsp;
<b>Pont horizontal avec un sentier ou hors piste</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont horizontal avec un sentier ou hors piste.<br><br>

<img src="images/pontpathv.gif" border="0">&nbsp;&nbsp;
<b>Pont vertical avec un chemin</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont vertical avec un chemin.<br><br>

<img src="images/pontpathh.gif" border="0">&nbsp;&nbsp;
<b>Pont horizontal avec un chemin</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont horizontal avec un chemin.<br><br>

<img src="images/pontroadv.gif" border="0">&nbsp;&nbsp;
<b>Pont vertical avec une route</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont vertical avec une route.<br><br>

<img src="images/pontroadh.gif" border="0">&nbsp;&nbsp;
<b>Pont horizontal avec une route</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont horizontal avec une route.<br><br>

<img src="images/pontnatv.gif" border="0">&nbsp;&nbsp;
<b>Pont vertical avec une route nationale</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont vertical avec une route nationale.<br><br>

<img src="images/pontnath.gif" border="0">&nbsp;&nbsp;
<b>Pont horizontal avec une route nationale</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont horizontal avec une route nationale.<br><br>

<img src="images/pontdlnv.gif" border="0">&nbsp;&nbsp;
<b>Pont vertical avec une route avec s&eacute;parateur central</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont vertical avec une route avec s&eacute;parateur central.<br><br>

<img src="images/pontdlnh.gif" border="0">&nbsp;&nbsp;
<b>Pont horizontal avec une route avec s&eacute;parateur central</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont horizontal avec une route avec s&eacute;parateur central.<br><br>

<img src="images/ponttrainv.gif" border="0">&nbsp;&nbsp;
<b>Pont vertical avec une voie de chemin de fer</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont vertical avec une voie de chemin de fer.<br><br>

<img src="images/ponttrainh.gif" border="0">&nbsp;&nbsp;
<b>Pont horizontal avec une voie de chemin de fer</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont horizontal avec une voie de chemin de fer.<br><br>

<img src="images/pontriverv.gif" border="0">&nbsp;&nbsp;
<b>Pont vertical avec une rivi&egrave;re</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont vertical avec une rivi&egrave;re.<br><br>

<img src="images/pontriverh.gif" border="0">&nbsp;&nbsp;
<b>Pont horizontal avec une rivi&egrave;re</b><br>
Pour s&eacute;lectionner le pont correspondant &agrave; un pont horizontal avec une rivi&egrave;re.<br><br>

</div>
</body>
</html>