<html>
<head>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body leftmargin="5" marginwidth="5" topmargin="5" marginheight="5">

<table border="0" width="100%" class="bordure" cellspacing="0" cellpadding="1">
<tr><td>
<table border="0" width="100%" class="textSubTitleCenter" cellspacing="0" cellpadding="0">
<tr><td class="textTitle">JvRoad</td>
<td class="textSubTitleRight">Manuel de r&eacute;f&eacute;rence</tr>
<tr><td colspan="2"><br>Les boutons concernant les traits</td></tr>
</table>
</td></tr></table>
<br>
<div class="textJustify">
<img src="images/linenone.gif" border="0">&nbsp;&nbsp;
<b>Effacer</b><br>
Pour s&eacute;lectionner l'effaceur de sentiers, de chemins, de routes ou de routes nationales.<br><br>

<b>Sentier ou hors piste</b><br>
<img src="images/linesent.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; un sentier ou hors piste.<br>
<img src="images/lsendst.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une destination sur un sentier ou hors piste.<br>
<img src="images/lsendsti.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une destination inverse sur un sentier ou hors piste.<br>
<img src="images/lsensrc.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une origine sur un sentier ou hors piste.<br>
<img src="images/lsensrci.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une origine inverse sur un sentier ou hors piste.<br><br>
<b>Chemin</b><br>
<img src="images/linepath.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; un chemin.<br>
<img src="images/linepdst.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une destination sur un chemin.<br>
<img src="images/linepdsti.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une destination inverse sur un chemin.<br>
<img src="images/linepsrc.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une origine sur un chemin.<br>
<img src="images/linepsrci.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une origine inverse sur un chemin.<br><br>
<b>Route</b><br>
<img src="images/lineroad.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une route.<br>
<img src="images/linerdst.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une destination sur une route.<br>
<img src="images/linerdsti.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une destination inverse sur une route.<br>
<img src="images/linersrc.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une origine sur une route.<br>
<img src="images/linersrci.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une origine inverse sur une route.<br><br>
<b>Route nationale</b><br>
<img src="images/linenat.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une route nationale.<br>
<img src="images/linendst.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une destination sur une route nationale.<br>
<img src="images/linendsti.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une destination inverse sur une route nationale.<br>
<img src="images/linensrc.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une origine sur une route nationale.<br>
<img src="images/linensrci.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une origine inverse sur une route nationale.<br><br>
<b>Route avec s&eacute;parateur central</b><br>
<img src="images/dline.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une route avec s&eacute;parateur central.<br>
<img src="images/dlindst.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une destination sur une route avec s&eacute;parateur central.<br>
<img src="images/dlindsti.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une destination inverse sur une route avec s&eacute;parateur central.<br>
<img src="images/dlinsrc.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une origine sur une route avec s&eacute;parateur central.<br>
<img src="images/dlinsrci.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une origine inverse sur une route avec s&eacute;parateur central.<br><br>
<b>Autres</b><br>
<img src="images/linetrain.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une voie de chemin de fer.<br>
<img src="images/lineriver.gif" border="0">&nbsp;&nbsp;Pour s&eacute;lectionner le trait correspondant &agrave; une rivi&egrave;re.<br>

</div>
</body>
</html>