<html>
<head>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body leftmargin="5" marginwidth="5" topmargin="5" marginheight="5">

<table border="0" width="100%" class="bordure" cellspacing="0" cellpadding="1">
<tr><td>
<table border="0" width="100%" class="textSubTitleCenter" cellspacing="0" cellpadding="0">
<tr><td class="textTitle">JvRoad</td>
<td class="textSubTitleRight">Manuel de r&eacute;f&eacute;rence</tr>
<tr><td colspan="2"><br>Les commandes du menu Livre</td></tr>
</table>
</td></tr></table>
<br>
<div class="textJustify">

<b>Nouveau</b>
&nbsp;&nbsp;(<img src="images/new.gif" border="0">, Alt+LN ou Ctrl+N)<br>
Pour cr&eacute;er un nouveau road book.
<br><br>

<b>Ouvrir</b>
&nbsp;&nbsp;(<img src="images/open.gif" border="0">, Alt+LO ou F3)<br>
Pour ouvrir un road book existant. <a href="dlgopen.html">une bo&icirc;te de dialogue</a> pour s&eacute;lectionner un fichier est affich&eacute;e.Les anciens road book sont relus, en revanche, il est impossible de les enregistrer dans l'ancien format.
<br><br>

<b>Fermer</b>
&nbsp;&nbsp;(Alt+LF ou Ctrl+F4)<br>
Pour ouvrir un road book existant. Les anciens road book sont relus, en revanche, il est impossible de les enregistrer dans l'ancien format.
<br><br>

<b>Enregistrer</b>
&nbsp;&nbsp;(<img src="images/save.gif" border="0">, Alt+LE ou F2)<br>
Pour enregistrer le road book en cours d'&eacute;dition. Si le road book n'a jamais &eacute;t&eacute; enregistr&eacute;, <a href="dlgsave.html">une bo&icirc;te de dialogue</a> pour saisir un nom de fichier est affich&eacute;e. Les road books dans les anciens formats sont enregsitr&eacute;s dans le format de JvRoad.
<br><br>

<b>Enregistrer sous</b>
&nbsp;&nbsp;(<img src="images/saveas.gif" border="0">, Alt+LS ou Ctrl+F2)<br>
Pour enregistrer le road book en cours d'&eacute;dition dans un fichier en particulier. <a href="dlgsave.html">Une bo&icirc;te de dialogue</a> pour saisir un nom de fichier est affich&eacute;e. Les road books dans les anciens formats sont enregsitr&eacute;s dans le format de JvRoad.
<br><br>

<b>Aper&ccedil;u impression</b>
&nbsp;&nbsp;(<img src="images/preview.gif" border="0"> ou Alt+LA)<br>
Pour afficher la <a href="dlgpreview.html">fen&ecirc;tre d'aper&ccedil;u avant impression</a>. Cette fen&ecirc;tre permet de modifier la pr&eacute;sentation des pages et d'en visualiser le r&eacute;sultat sans qu'il soit n&eacute;cessaire de les imprimer.
<br><br>

<b>Configurer impression</b>
&nbsp;&nbsp;(Alt+LM)<br>
Pour afficher la <a href="dlgcnfprnt.html">bo&icirc;te de dialogue de r&eacute;glage des marges</a>.
<br><br>

<b>Imprimer</b>
&nbsp;&nbsp;(<img src="images/print.gif" border="0">, Alt+LI ou Ctrl+P)<br>
Pour imprimer le road book en cours d'&eacute;dition.
<br><br>

<b>Imprimer l&eacute;gende</b>
&nbsp;&nbsp;(Alt+LG)<br>
Pour imprimer sur une feuille de papier la signification de chaque indication qui peuvent &ecirc;tre utilis&eacute;e lors de la r&eacute;daction d'un road book.
<br><br>

<b>Imprimer feuille vierge</b>
&nbsp;&nbsp;(Alt+LR)<br>
Pour imprimer des feuilles vierges qui utilisent la pr&eacute;sentation du road book en cours d'&eacute;dition.
<br><br>

<b>Quitter</b>
&nbsp;&nbsp;(Alt+LA ou Alt+F4)<br>
Pour quitter l'application. Si un road book a &eacute;t&eacute; modifi&eacute; sans &ecirc;tre enregistr&eacute;, une confirmation est demand&eacute;e avant de sortir.
<br><br>
</div>
</body>
</html>