<html>
<head>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body leftmargin="5" marginwidth="5" topmargin="5" marginheight="5">

<table border="0" width="100%" class="bordure" cellspacing="0" cellpadding="1">
<tr><td>
<table border="0" width="100%" class="textSubTitleCenter" cellspacing="0" cellpadding="0">
<tr><td class="textTitle">JvRoad</td>
<td class="textSubTitleRight">Manuel de r&eacute;f&eacute;rence</tr>
<tr><td colspan="2"><br>Les commandes du menu Edition</td></tr>
</table>
</td></tr></table>
<br>
<div class="textJustify">
<b>Coller</b>
&nbsp;&nbsp;(Alt+EC ou Ctrl+V)<br>
Pour coller la s&eacute;lection. Si la s&eacute;lection est une case, la case en cours d'&eacute;dition est remplac&eacute;e par la s&eacute;lection. Si la s&eacute;lection est un ensemble de cartes, toutes les cartes de la case en cours d'&eacute;dition sont remplac&eacute;es par la s&eacute;lection. Si la s&eacute;lection est une carte, la carte courante de la case en cours d'&eacute;dition est remplac&eacute;e par la s&eacute;lection.
<br><br>

<b>Coller par insertion</b>
&nbsp;&nbsp;(Alt+EP ou Ctrl+E)<br>
Pour coller la s&eacute;lection dans une nouvelle case ins&eacue;r&eacute;e &agrave; la position actuelle.
<br><br>

<b>Copier case</b>
&nbsp;&nbsp;(Alt+EE ou Ctrl+C)<br>
Copier la case en cours d'&eacute;dition dans la s&eacute;lection courante.
<br><br>

<b>Copier les cartes</b>
&nbsp;&nbsp;(Alt+ET ou Ctrl+W)<br>
Copier l'ensemble des cartes de la case en cours d'&eacute;dition dans la s&eacute;lection courante.
<br><br>

<b>Copier la carte affich&eacute;e</b>
&nbsp;&nbsp;(Alt+EF ou Ctrl+O)<br>
Copier la carte courante de la case en cours d'&eacute;dition dans la s&eacute;lection courante.
<br><br>

<b>Ajouter case</b>
&nbsp;&nbsp;(<img src="images/add.gif" border="0">, Alt+EA ou Ctrl+A)<br>
Pour ajouter une case &agrave; la fin du road book. Le nombre maximal de cases dans un road book d&eacute;pend de la version.
<br><br>

<b>Ins&eacute;rer case</b>
&nbsp;&nbsp;(<img src="images/insert.gif" border="0">, Alt+EI ou Ctrl+I)<br>
Pour ins&eacute;rer une case &agrave; la position actuelle. Le nombre maximal de cases dans un road book d&eacute;pend de la version.
<br><br>

<b>Supprimer case</b>
&nbsp;&nbsp;(<img src="images/del.gif" border="0">, Alt+ES ou Ctrl+Y)<br>
Pour supprimer la case en cours d'&eacute;dition.
<br><br>

<b>S&eacute;lectionner - Premier objet</b>
&nbsp;&nbsp;(Alt+ENP ou Ctrl+Origine)<br>
Pour s&eacute;lectionner le premier objet de la palette d'outils associ&eacute;e &agrave; la carte en cours d'&eacute;dition.
<br><br>

<b>S&eacute;lectionner - Pr&eacute;c&eacute;dent objet</b>
&nbsp;&nbsp;(Alt+ENR ou Ctrl+Gauche)<br>
Pour s&eacute;lectionner le pr&eacute;c&eacute;dent objet de la palette d'outils associ&eacute;e &agrave; la carte en cours d'&eacute;dition.
<br><br>

<b>S&eacute;lectionner - Prochain objet</b>
&nbsp;&nbsp;(Alt+ENC ou Ctrl+Droite)<br>
Pour s&eacute;lectionner le prochain objet de la palette d'outils associ&eacute;e &agrave; la carte en cours d'&eacute;dition.
<br><br>

<b>S&eacute;lectionner - Dernier objet</b>
&nbsp;&nbsp;(Alt+END ou Ctrl+Fin)<br>
Pour s&eacute;lectionner le dernier objet de la palette d'outils associ&eacute;e &agrave; la carte en cours d'&eacute;dition.
<br><br>

<b>Ajouter livre</b>
&nbsp;&nbsp;(Alt+EJ)<br>
Pour ajouter les cases d'un road book &agrave; la fin du road book en cours d'&eacute;dition. L'ajout des cases est effectu&eacute; en tenant compte du nombre maximale de cases permises dans un road book. Le nombre maximal de cases dans un road book d&eacute;pend de la version.
<br><br>

<b>Ins&eacute;rer livre</b>
&nbsp;&nbsp;(Alt+EL)<br>
Pour ins&eacute;rer les cases d'un road book &agrave; la position actuelle dans le road book en cours d'&eacute;dition. L'insertion des cases est effectu&eacute;e en tenant compte du nombre maximale de cases permises dans un road book. Le nombre maximal de cases dans un road book d&eacute;pend de la version.
<br><br>
</div>
</body>
</html>