<html>
<head>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body leftmargin="5" marginwidth="5" topmargin="5" marginheight="5">

<table border="0" width="100%" class="bordure" cellspacing="0" cellpadding="1">
<tr><td>
<table border="0" width="100%" class="textSubTitleCenter" cellspacing="0" cellpadding="0">
<tr><td class="textTitle">JvRoad</td>
<td class="textSubTitleRight">Manuel de r&eacute;f&eacute;rence</tr>
<tr><td colspan="2"><br>La bo&icirc;te de dialogue: Case</td></tr>
</table>
</td></tr></table>
<br>
<center>
<img src="images/dlgcase1.gif" border="0"><br><br>
<img src="images/fmtcmt.jpg" border="0">
</center>
<br><br>
<div class="textJustify">
<b>Description g&eacute;n&eacute;rale</b><br><br>
Cette bo&icirc;te de dialogue permet de renseigner les diff&eacute;rentes caract&eacute;ristiques de la case au travers d'un ensemble de champs r&eacute;partis sur deux onglets.<br><br>

<b>Les champs de l'onglet G&eacute;n&eacute;ral</b><br><br>
<i>Le champ "Partiel"</i>:<br>
Contient la distance partiel de la case. L'unit&eacute; de distance est indiqu&eacute;e &agrave; droite de la zone de saisie.<br><br>
<i>Le champ "Remise &agrave; z&eacute;ro"</i>:<br>
Pour indiquer si une remise &agrave; doit &ecirc;tre fait au niveau de cette case.<br><br>
<i>Le champ "Distance approximative"</i>:<br>
Pour indiquer si la distance indiqu&eacute;e est approximative au niveau de cette case.<br><br>
<i>Le champ "Distance inconnue"</i>:<br>
Pour indiquer que cette case ne poss&egrave;de pas de distance.<br><br>
<i>Le champ "Indication num&eacute;ro 1"</i>:<br>
Pour indiquer la premi&egrave;re indication qui doit figurer sous la forme de petit dessin dans la case.<br><br>
<i>Le champ "Indication num&eacute;ro 2"</i>:<br>
Pour indiquer la deuxi&egrave;me indication qui doit figurer sous la forme de petit dessin dans la case.<br><br>
<i>Le champ "Indication num&eacute;ro 3"</i>:<br>
Pour indiquer la troisi&egrave;me indication qui doit figurer sous la forme de petit dessin dans la case.<br><br>
<i>Le champ "Indication num&eacute;ro 4"</i>:<br>
Pour indiquer la quatri&egrave;me indication qui doit figurer sous la forme de petit dessin dans la case.<br><br>
<b>Les champs de l'onglet Texte</b><br><br>
<i>Le champ "Texte centr&eacute;"</i>:<br>
Si ce champ est coch&eacute; alors le texte sera affich&eacute; centr&eacute; dans l'autre cas, il est align&eacute; &agrave; gauche.<br><br>
<i>Le champ "Zone de saisie de texte"</i>:<br>
Cette zone est utilis&eacute;e pour indiquer le texte associ&eacute; &agrave; la case. La longueur maximale du texte d&eacute;pend des param&egrave;tres de pr&eacute;sentation.
</div>
</body>
</html>