<html>
<head>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body leftmargin="5" marginwidth="5" topmargin="5" marginheight="5">

<table border="0" width="100%" class="bordure" cellspacing="0" cellpadding="1">
<tr><td>
<table border="0" width="100%" class="textSubTitleCenter" cellspacing="0" cellpadding="0">
<tr><td class="textTitle">JvRoad</td>
<td class="textSubTitleRight">Manuel de Format</tr>
<tr><td colspan="2"><br>Cr&eacute;ation d'un road book: Ajouter une case</td></tr>
</table>
</td></tr></table>
<br>
<div class="textJustify">
Choisir <a href="cmdedit.html">Ajouter Case</a> dans le menu <a href="cmdedit.html">Edition</a>, une <a href="dlgcase.html">bo&icirc;te de dialogue</a> appara&icirc;t pour vous permettre de saisir des informations sur la case. Dans le cadre de la progression de cette formation, nous allons nous limiter &agrave; un click sur le bouton "Ok".<br><br>
<center>
<img src="images/fmtadd.jpg" border="1">
</center>
<br><br>
Comme l'indique l'onglet &agrave; pr&eacute;sent notre road book comporte deux cases et l'&eacutediteur est positionn&eacute; sur la deuxi&egrave;me case. Il existe quatre autres mani&egrave;res d'ajouter une ou plusieurs cases dans un road book.
<table class="textJustify" border="0" cellpadding="0" cellspacing="0" width="100%">
<tr><td valign="top" width"10"><li></td><td>
L'insertion d'une case: Alors que l'ajout d'une case se fait en fin de road book, l'insertion de la nouvelle case se fait &agrave; la position courante. Ainsi si vous demandez l'insertion d'une case alors que vous &ecirc;tes sur la premi&egrave;re case, alors la nouvelle case sera ins&eacute;r&eacute;e &agrave; la premi&egrave;re position.
</td></tr>
<tr><td valign="top" width"10"><li></td><td>
Le coller par insertion: Cette op&eacute;ration est semblable &agrave; la premi&egrave;re &agrave; l'exception du fait qu'on insert une case qui a &eacute;t&eacute; copi&eacute;e dans le presse papier de l'application.
</td></tr>
<tr><td valign="top" width"10"><li></td><td>
L'ajout d'un livre: Cette op&eacute;ration revient &agrave; importer le contenu d'un autre road book pour l'ajouter &agrave; la fin du road book en cours d'&eacute;dition.
</td></tr>
<tr><td valign="top" width"10"><li></td><td>
L'insertion d'un livre: Cette op&eacute;ration revient &agrave; importer le contenu d'un autre road book pour l'ins&eacute;rer dans road book en cours d'&eacute;dition.
</td></tr></table>
</div>
<div class="textLeft">&nbsp;</div>
<div class="textCenter">
<a href="fmtcopy.html">&lt;&lt; Etape pr&eacute;c&eacute;dente</a>&nbsp;-&nbsp;<a href="fmtdel.html">Etape suivante &gt;&gt;</a>
</div>
</body>
</html>
