<html>
<head>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body leftmargin="5" marginwidth="5" topmargin="5" marginheight="5">

<table border="0" width="100%" class="bordure" cellspacing="0" cellpadding="1">
<tr><td>
<table border="0" width="100%" class="textSubTitleCenter" cellspacing="0" cellpadding="0">
<tr><td class="textTitle">JvRoad</td>
<td class="textSubTitleRight">Manuel de Format</tr>
<tr><td colspan="2"><br>Cr&eacute;ation d'un road book: Cr&eacute;er un road book</td></tr>
</table>
</td></tr></table>
<br>
<div class="textJustify">
Choisir <a href="cmdbook.html">Nouveau</a> dans le menu <a href="cmdbook.html">Livre</a>, une <a href="dlglivre.html">bo&icirc;te de dialogue</a> appara&icirc;t pour vous demander des renseignements concernant votre nouveau road book. Dans le cadre de cette formation, nous allons pour l'instant nous limiter &agrave; effectuer un click sur le bouton "Ok" et obtenir l'image de ci-dessous.<br>
<center><img src="images/fmtfirst.jpg" border="0"></center><br><br>
Le petit onglet "*A renseigner [1/1]" indique pour l'instant que votre road book s'appelle "A renseigner", qu'il comporte une case, que la case en cours d'&eacute;dition est la premi&egrave;re et que des modifications (la petite *) ont &eacute;t&eacute; effectu&eacute;es depuis la derni&egrave;re sauvegarde (normal dans le cas pr&eacute;sent puisque nous venons de le cr&eacute;er). Pour chaque road book cr&eacute;&eacute; ou ouverture en m&ecirc;me temps vous aurez un onglet suppl&eacute;mentaire. La zone de travail associ&eacute;e &agrave; l'onglet permet d'&eacute;diter les cases du road.<br>
<center><img src="images/fmtwork.jpg" border="1"></center><br><br>

La zone de travail situ&eacute;e sur la droite correspond au navigateur. Le navigateur permet de se d&eacute;placer dans le road book et d'avoir un aper&ccedil;u des cases telles qu'elles pourront appara&icirc;tre au final.<br>
<center><img src="images/fmtnav.jpg" border="1"></center><br><br>

La zone de travail situ&eacute;e en bas correspond au v&eacute;rificateur. Le v&eacute;rificateur analyse en temps r&eacute;el le contenu du road book pour y rep&eacute;rer les &eacute;ventuelles erreurs ou avertissements que pourrait comporter votre road book.<br>
<center><img src="images/fmtverif.jpg" border="1"></center><br><br>

</div>

<div class="textLeft">&nbsp;</div>
<div class="textCenter">
<a href="creation.html">&lt;&lt; Etape pr&eacute;c&eacute;dente</a>&nbsp;-&nbsp;<a href="fmtsave.html">Etape suivante &gt;&gt;</a>
</div>
</body>
</html>
