<html>
<head>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body leftmargin="5" marginwidth="5" topmargin="5" marginheight="5">

<table border="0" width="100%" class="bordure" cellspacing="0" cellpadding="1">
<tr><td>
<table border="0" width="100%" class="textSubTitleCenter" cellspacing="0" cellpadding="0">
<tr><td class="textTitle">JvRoad</td>
<td class="textSubTitleRight">Manuel de Format</tr>
<tr><td colspan="2"><br>Cr&eacute;ation d'un road book: Mon premier dessin</td></tr>
</table>
</td></tr></table>
<br>
<div class="textJustify">
A pr&eacute;sent, nous allons nous pencher sur la r&eacute;alisation de dessins avec l'aide des cartes. Chaque type de carte est un assistant au dessin. Pour chaque dessin, vous pouvez utiliser en superposition quatre cartes, tout en sachant que la derni&egrave;re est r&eacute;serv&eacute;e pour les objets. Mais commen&ccedil;ons par une r&eacute;alisation simple. Pour cela nous allons utiliser la carte Carrefour qui permet de d&eacute;crire un carrefour en quelques clicks de souris seulement.<br><br>
Pour choisir le type de carte Carrefour, vous pouvez cliquer sur le bouton situ&eacute; en bas de la fen&ecirc;tre d'&eacute;dition qui correspond &agrave; la carte Carrefour (en pla&ccedil;ant la souris sur le bouton, vous pouvez conna&icirc;tre sa signification). Vous pouvez &eacute;galement choisir <a href="cmdmap.html">Carrefour</a> dans le menu <a href="cmdmap.html">Cartes - Type de carte</a>, un quadrillage correspondant &agrave; la carte Carrefour appara&icirc;t au centre de la fen&ecirc;tre d'&eacute;dition de la case.<br><br>
Sur la gauche de la carte, vous avez une palette avec diff&eacute;rents boutons, les trois premiers (en jaune) concernent les donn&eacute;es de la case et la possibilit&eacute; de faire une rotation de la carte. Les boutons suivants concernent la carte. Dans le cadre de la carte Carrefour, il s'agit des diff&eacute;rents types de traits. Pour placer un trait sur la carte, il suffit de choisir son type de trait puis de cliquer dans le petit carr&eacute; gris o&ugrave; l'on souhaite qu'il se place. Pour effacer un trait, vous pouvez utiliser le trait "poubelle" ou le click droit dans le petit carr&eacute;.<br><br>
<center>
<img src="images/fmtcarre.jpg" border="0"><br><br>
</center>
</div>
<div class="textLeft">&nbsp;</div>
<div class="textCenter">
<a href="fmttxt.html">&lt;&lt; Etape pr&eacute;c&eacute;dente</a>&nbsp;-&nbsp;<a href="fmtrond.html">Etape suivante &gt;&gt;</a>
</div>
</body>
</html>
