<html>
<head>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body leftmargin="5" marginwidth="5" topmargin="5" marginheight="5">

<table border="0" width="100%" class="bordure" cellspacing="0" cellpadding="1">
<tr><td>
<table border="0" width="100%" class="textSubTitleCenter" cellspacing="0" cellpadding="0">
<tr><td class="textTitle">JvRoad</td>
<td class="textSubTitleRight">Manuel de Format</tr>
<tr><td colspan="2"><br>Cr&eacute;ation d'un road book: La superposition de cartes</td></tr>
</table>
</td></tr></table>
<br>
<div class="textJustify">
A pr&eacute;sent, notre objectif est d'ajouter une nouvelle case &agrave; notre road book. Le dessin de cette nouvelle case (voir ci-dessous) est nettement plus complexe car il n&eacute;cessite l'utilisation de trois cartes. N&eacute;anmoins cela reste facile &agrave; construire.<br><br>
<center>
<img src="images/fmtsup0.jpg" border="1">
</center><br><br>
Nous n'attarderons pas les processus pour ajouter une case et d&eacute;finir sa distance partielle qui ont d&eacute;j&agrave; &eacute;t&eacute; abord&eacute;s. Pour r&eacute;aliser ce dessin, nous allons utiliser les cartes Rond Point, Grille et Objets.<br><br>
<b>Premi&egrave;re &eacute;tape:</b><br>
<table class="textJustify" border="0" width="100%" cellspacing="0" cellpadding="0">
<tr><td width="10" valign="top"><li></td><td>
Choisir la carte <a href="cmdmap.html">Rond Point</a>.
</td></tr>
<tr><td width="10" valign="top"><li></td><td>
Choisir le type de trait <a href="btntraits.html">Chemin</a> puis click dans le petit carr&eacute; pour le placer.
</td></tr>
<tr><td width="10" valign="top"><li></td><td>
Choisir le type de trait <a href="btntraits.html">Route</a> puis click dans le petit carr&eacute; pour le placer.
</td></tr>
<tr><td width="10" valign="top"><li></td><td>
Choisir le type de trait <a href="btntraits.html">Route nationale</a> puis click dans les deux petits carr&eacute;s pour les placer.
</td></tr>
</table>
On obtient ainsi:<br><br>
<center>
<img src="images/fmtsup1.jpg" border="1">
</center><br><br>
<b>Deuxi&egrave;me &eacute;tape:</b><br>
Nous allons &agrave; pr&eacute;sent utiliser une deuxi&egrave;me carte. Cette deuxi&egrave;me carte, nous allons la mettre sur la deuxi&egrave;me vue afin de ne pas perdre la premi&egrave;re. Pour cela, choisir <a href="cmdmap.html">Deuxi&egrave;me carte</a> dans le menu <a href="cmdmap.html">Cartes - Type de vue</a>. Vous remarquer que notre dessin s'affiche en rouge au lieu d'en noir. C'est normal, en mode &eacute;dition seul les traits de la carte courante apparaissent en noir, les autres sont affich&eacute;s en rouge pour les diff&eacute;rencier.<br><br>
<center>
<img src="images/fmtsup2.jpg" border="1">
</center><br><br>
<table class="textJustify" border="0" width="100%" cellspacing="0" cellpadding="0">
<tr><td width="10" valign="top"><li></td><td>
Choisir la carte <a href="cmdmap.html">Grille</a>.
</td></tr>
<tr><td width="10" valign="top"><li></td><td>
Choisir le type de trait <a href="btntraits.html">Chemin</a> puis click dans les traits du quadrillage pour les placer.
</td></tr>
<tr><td width="10" valign="top"><li></td><td>
Choisir le type de trait <a href="btntraits.html">Chemin - Origine</a> puis click dans le trait du quadrillage pour le placer.
</td></tr>
<tr><td width="10" valign="top"><li></td><td>
Choisir le type de trait <a href="btntraits.html">Chemin - Destination inverse</a> puis click dans le trait du quadrillage pour le placer.
</td></tr>
</table>
On obtient ainsi:<br><br>
<center>
<img src="images/fmtsup3.jpg" border="1">
</center><br><br>
<b>Troisi&egrave;me &eacute;tape:</b><br>
Nous allons &agrave; pr&eacute;sent utiliser la carte des objets. Cette carte poss&egrave;de sa propre vue. Pour cela, choisir <a href="cmdmap.html">Cartes des objets</a> dans le menu <a href="cmdmap.html">Cartes - Type de vue</a>.<br>
<table class="textJustify" border="0" width="100%" cellspacing="0" cellpadding="0">
<tr><td width="10" valign="top"><li></td><td>
Choisir l'objet <a href="btnobjs.html">Grande maison</a> puis click dans l'un des carr&eacute;s d&eacute;limit&eacute; par le quadrillage pour placer l'objet. Certains objets peuvent occuper la place de plusieurs carr&eacute;s. Le click droit ou l'objet poubelle permettent de supprimer un objet.
</td></tr>
</table>
On obtient ainsi:<br><br>
<center>
<img src="images/fmtsup4.jpg" border="1">
</center><br><br>
Le choix de la vue <a href="cmdmap.html">Aper&ccedil;ue</a> permet de visualiser le r&eacute;sultat final.<br><br>
<center>
<img src="images/fmtsup5.jpg" border="1">
</center>
</div>
<div class="textLeft">&nbsp;</div>
<div class="textCenter">
<a href="fmtcarre.html">&lt;&lt; Etape pr&eacute;c&eacute;dente</a>&nbsp;-&nbsp;<a href="fmtvect.html">Etape suivante &gt;&gt;</a>
</div>
</body>
</html>
