<html>
<head>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body leftmargin="5" marginwidth="5" topmargin="5" marginheight="5">

<table border="0" width="100%" class="bordure" cellspacing="0" cellpadding="1">
<tr><td>
<table border="0" width="100%" class="textSubTitleCenter" cellspacing="0" cellpadding="0">
<tr><td class="textTitle">JvRoad</td>
<td class="textSubTitleRight">Manuel de Format</tr>
<tr><td colspan="2"><br>Cr&eacute;ation d'un road book: Cas de la carte vectorielle</td></tr>
</table>
</td></tr></table>
<br>
<div class="textJustify">
Parmi les cartes disponibles, la carte vectorielle n&eacute;cessite quelques explications dans son usage. Pour continuer notre progression, nous ajoutons donc une nouvelle case &agrave; notre road book. Puis nous choisissons <a href="cmdmap.html">Vectorielle</a> dans le menu <a href="cmdmap.html">Cartes - Type de carte</a>.<br><br>
<center>
<img src="images/fmtvect1.jpg" border="1">
</center><br><br>
Cette carte permet de manipuler des segments de droites qui sont d&eacute;limit&eacute;s par deux points (un &agrave; chaque extr&eacute;mit&eacute;) et des morceaux de courbes qui sont d&eacute;limit&eacute;s par trois points (un &agrave; chaque extr&eacute;mit&eacute; plus un point d'inflexion pour ajuster la courbure).<br><br>
<b>Placer un segment</b><br>
Chaque extr&eacute;mit&eacute; doit &ecirc;tre positionn&eacute;e sur l'une des croix grise. Pour placer un segment:
<table class="textJustify" border="0" width="100%" cellpadding="0" cellspacing="0">
<tr><td valign="top" width="10"><li></td><td>
Click sur le bouton <i>Tracer un segment</i>.
</td></tr>
<tr><td valign="top" width="10"><li></td><td>
Placer la souris sur la croix correspondant au point de d&eacute;part du segment.
</td></tr>
<tr><td valign="top" width="10"><li></td><td>
Enfoncer le bouton de la souris, le d&eacute;placer tout en le maintenant enfonc&eacute; (mouvement de drag & drop) jusqu'&agrave; la croix correspondant &agrave; la deuxi&egrave;me extr&eacute;mit&eacute; du segment.
</td></tr>
<tr><td valign="top" width="10"><li></td><td>
Relacher le bouton, le segment appara&icirc;t en bleu. Le segment en cours d'&eacute;dition est affich&eacute; en bleu alors que les autres sont affich&eacute;s en noir.
</td></tr>
</table><br><br>
<center>
<img src="images/fmtvect2.jpg" border="1">
</center><br><br>

<b>D&eacute;placer un segment</b><br>
<table class="textJustify" border="0" width="100%" cellpadding="0" cellspacing="0">
<tr><td valign="top" width="10"><li></td><td>
Click sur le bouton <i>D&eacute;placer un point</i>
</td></tr>
<tr><td valign="top" width="10"><li></td><td>
Placer la souris sur l'extr&eacute;mit&eacute; &agrave; d&eacute;placer.
</td></tr>
<tr><td valign="top" width="10"><li></td><td>
Enfoncer le bouton de la souris, le d&eacute;placer tout en le maintenant enfonc&eacute; (mouvement de drag & drop) jusqu'&agrave; atteindre la nouvelle position.
</td></tr>
<tr><td valign="top" width="10"><li></td><td>
Relacher le bouton, le segment appara&icirc;t &agrave; sa nouvelle position.
</td></tr>
</table><br><br>
<center>
<table class="textCenter" border="0" width="100%" cellpadding="0" cellspacing="0"><tr><td>
<img src="images/fmtvect3.jpg" border="1"><br>
D&eacute;placement
</td><td>
<img src="images/fmtvect4.jpg" border="1"><br>
Place apr&egrave;s relachement du bouton
</td></tr></table>
</center><br><br>

<b>Placer une courbe</b><br>
La d&eacute;marche pour placer une courbe est identique &agrave; celle pour un segment. Au lieu de faire un click sur le bouton <i>Tracer un segment</i>, il faut le faire sur le bouton <i>Tracer une courbe</i>. Le point d'inflexion de la courbe ne peut pas &ecirc;tre modifi&eacute; lors du placement de la courbe, en revanche le mode <i>D&eacute;placer un point</i> permet de le faire.<br><br>
<center>
<img src="images/fmtvect5.jpg" border="1"><br>
</center><br><br>

<b>Supprimer le segment (ou la courbe) en d'&eacute;dition</b><br>
Il suffit se faire un click sur le bouton <i>Supprimer</i>. Si l'&eacute;l&eacute;ment &agrave; supprimer n'est pas celui en cours d'&eacute;dition, alors il faut utiliser le mode <i>S&eacute;lection</i> (Click sur le bouton correspondant) pour le s&eacute;lectionner avant de le supprimer.<br><br>
<b>Note</b><br>
La vue aper&ccedil;ue permet d'avoir une vision de la carte telle qu'elle sera visible au final (Touts les &eacute;l&eacute;ments sont en noir et les points d'inflexion ne sont plus indiqu&eacute;s).<br><br>
<center>
<img src="images/fmtvect6.jpg" border="1"><br>
</center><br><br>

</div>
<div class="textLeft">&nbsp;</div>
<div class="textCenter">
<a href="fmtrond.html">&lt;&lt; Etape pr&eacute;c&eacute;dente</a>&nbsp;-&nbsp;<a href="fmtnav.html">Etape suivante &gt;&gt;</a>
</div>
</body>
</html>