<html>
<head>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body leftmargin="5" marginwidth="5" topmargin="5" marginheight="5">

<table border="0" width="100%" class="bordure" cellspacing="0" cellpadding="1">
<tr><td>
<table border="0" width="100%" class="textSubTitleCenter" cellspacing="0" cellpadding="0">
<tr><td class="textTitle">JvRoad</td>
<td class="textSubTitleRight">Manuel de d&eacute;marrage</tr>
<tr><td colspan="2"><br>Pr&eacute;sentation</td></tr>
</table>
</td></tr></table>
<br>
<div class="textJustify">
JvRoad est un outil d'aide &agrave; la r&eacute;daction de road-book. Ce produit a &eacute;t&eacute; con&ccedil;u en fonction des demandes de ses premiers utilisateurs sur le terrain. Et il continuera &agrave; &eacute;voluer en fonction des demandes (lorsqu'elles sont r&eacute;alistes !) de ses utilisateurs. Historiquement, JvRoad est la quatri&egrave;me g&eacute;n&eacute;ration d'&eacute;diteur de road book (les trois premiers sont Road, Road32 et Road 3000). Cette documentation se d&eacute;compose en plusieurs parties:<br><br>
La premi&egrave;re partie est consacr&eacute;e &agrave; l'<a href="install.html">installation</a> du logiciel, &agrave; sa configuration et au <a href="support.html">support</a>.<br><br>
La deuxi&egrave;me partie comporte le manuel de <a href="formation.html">formation</a> qui explique comment r&eacute;aliser un road-book. Cette partie sous-entend que la r&eacute;daction de road-book n'est pas un exercice inconnu de votre part.<br><br>
La troisi&egrave;me partie comporte le manuel de <a href="ref.html">r&eacute;f&eacute;rence</a> de toutes les commandes et de toutes les bo&icirc;te de dialogue du logiciel.<br><br>
Cela dit, on est tous tr&egrave;s heureux de vous compter parmi les utilisateurs de JvRoad. JvRoad est un produit vivant, autrement dit, qui va &eacute;voluer afin d'offrir encore plus de possibilit&eacute;s. Cependant, tous les road book qui seront r&eacute;alis&eacute;s avec cette version pourront &ecirc;tre relus par les versions suivantes. JvRoad n'est pas totalement compatible avec les deux pr&eacute;c&eacute;dentes g&eacute;n&eacute;rations d'&eacute;diteurs de road book, autrement dit, JvRoad n'est pas capable de relire int&eacute;gralement les anciens road book.  Si vous d&eacute;sirez des &eacute;volutions (r&eacute;aliste, JvRoad ne pourra transformer du plomb en or) pour une prochaine version, il vous suffit de vous rendre sur notre site <b>www.road.fr</b> &agrave; la rubrique <b>Support</b> pour y soumettre votre demande d'&eacute;volution. Si vous rencontrez un mauvais fonctionnement ou &agrave; quelque chose qui y ressemble, il vous suffit de vous rendre sur notre site <b>www.road.fr</b> &agrave; la rubrique <b>Support</b> pour y enregistrer le bug d&eacute;couvert. La derni&egrave;re version qui int&egrave;gre tous les correctifs est accessible 7 jours sur 7, 24 heures sur 24 via la page de JvRoad aux adresses suivantes www.road.fr ou www.osons4x4mag.net/boutiq/road.html.<br><br>
Il existe trois versions de JvRoad, la premi&egrave;re dite d'Evaluation est gratuite mais elle ne comporte pas toutes les fonctionnalit&eacute;s de la version Pro qui est payante. La troisi&egrave;me version dite Light est une version interm&eacute;diaire entre la version d'Evaluation et la Pro. Vous trouverez les diff&eacute;rences entre les trois versions d&eacute;critent sur notre site <b>www.road.fr</b> dans la Foire aux questions &agrave; la rubrique <b>Support</b>.<br><br>
Note : JvRoad reste un programme informatique parmi tant d'autre, cela &eacute;tant dit il ne pourra pas &ecirc;tre tenu pour responsable des pr&eacute;judices ou dommages de quelque nature que ce soit pouvant r&eacute;sulter de son utilisation. Toute reproduction, m&ecirc;me partielle, par quelque proc&eacute;d&eacute; que ce soit est interdite sans autorisation pr&eacute;alable. Une copie par X&eacute;rographie, photographie, bande magn&eacute;tique ou autre, constitue une contrefa&ccedil;on passible des peines pr&eacute;vues par la loi (du 11 mars 1957 et du 3 juillet 1985) sur la protection des droits d'auteur.<br>
</div>
</body>
</html>